package io.github.duolabmeng6.javeefun.core;

import org.junit.Test;

import static io.github.duolabmeng6.javeefun.core.算数运算.*;
import static org.junit.Assert.assertArrayEquals;
import static org.junit.Assert.assertEquals;

public class 算数运算Test {
    public static void 判断是否相同(Object func, Object value) {
        assertEquals(func, value);
    }

    @Test
    public void 测试_算数运算() {
        判断是否相同(四舍五入(123.144, 2), 123.14);
        判断是否相同(四舍五入(123.146, 2), 123.15);

        判断是否相同(取绝对值(-1),  (double)1);
        判断是否相同(取绝对值(-100),  (double)100);
        判断是否相同(取绝对值(-0.1),  (double)0.1);
        判断是否相同(取绝对值(0.1),  (double)0.1);

        判断是否相同(取整(100.111), 100);
        判断是否相同(到整数("8852791.5"), 8852791);
        判断是否相同(到整数("-8852791.5"), -8852791);
        判断是否相同(到整数("8852791.5123456789"), 8852791);
        判断是否相同(到整数("-8852791.5123456789"), -8852791);

        判断是否相同(求次方(2, 2), (double) 4);
        判断是否相同(求次方(4, 2), (double)16);
        判断是否相同(求余弦(30), 0.15425144988758405);
        判断是否相同(求反正切(30), 1.5374753309166493);
        判断是否相同(求平方根(2), 1.4142135623730951);
        判断是否相同(求正切(30), -6.405331196646276);
        判断是否相同(求正弦(30), -0.9880316240928618);
        判断是否相同(取随机数(1, 1), 1);
        判断是否相同(取整数("8852791.5"), 8852791);
        判断是否相同(取整数("+8852791.5"), 8852791);
        判断是否相同(取整数("-8852791.5"), -8852791);
        判断是否相同(取整数(8852791.5), 8852791);


    }

}